Revit 2027 API
BuiltInFailures.RebarSystemFailures.CannotPlacePathReininforcementWarn Property
 Can't find a host for Path Reinforcement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotPlacePathReininforcementWarn { get; }
Public Shared ReadOnly Property CannotPlacePathReininforcementWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotPlacePathReininforcementWarn {
	FailureDefinitionId^ get ();
}
static member CannotPlacePathReininforcementWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarSystemFailures Class
Autodesk.Revit.DB Namespace